app/views/itineraries/_itinerary_card.html.erb

SELECT "itinerary_items".* FROM "itinerary_items" WHERE "itinerary_items"."itinerary_id" = $1 ORDER BY "itinerary_items"."date" ASC, "itinerary_items"."time" ASC  [["itinerary_id", 1]]
---
<%# Grouper les activités par date %>
<% itinerary_items_by_date = itinerary.itinerary_items.order(:date, :time).group_by(&:date) %>