app/views/itineraries/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "user_trip_statuses" ON "users"."id" = "user_trip_statuses"."user_id" WHERE "user_trip_statuses"."trip_id" = $1  [["trip_id", 5]]
---
        <div class="trip-card__section-avatars">
          <% @trip.users.each do |user| %>