app/services/recommendation_generator.rb

SELECT "activity_items".* FROM "activity_items"
---
  def build_prompt
      # Récupérer toutes les activités disponibles
      activities = ActivityItem.all.map do |activity|