app/views/trips/_trip_card.html.erb

SELECT "user_trip_statuses".* FROM "user_trip_statuses" WHERE "user_trip_statuses"."trip_id" = $1 AND "user_trip_statuses"."user_id" = $2 LIMIT $3  [["trip_id", 3], ["user_id", 9], ["LIMIT", 1]]
---
<div id="trip_card_<%= trip.user_trip_statuses.find_by(user: current_user)&.id %>" class="trip-card">

SELECT "user_trip_statuses".* FROM "user_trip_statuses" WHERE "user_trip_statuses"."user_id" = $1 AND "user_trip_statuses"."invitation_accepted" = $2  [["user_id", 9], ["invitation_accepted", false]]
SELECT COUNT(*) FROM "user_trip_statuses" WHERE "user_trip_statuses"."trip_id" = $1 AND "user_trip_statuses"."invitation_accepted" = $2  [["trip_id", 1], ["invitation_accepted", false]]
---
          <%# TODO: REFACTO - Move this query to a model method: trip.pending_invitations_count %>
          Pending invitations (<%= trip.user_trip_statuses.where(invitation_accepted: false).count %>)

SELECT COUNT(*) FROM "user_trip_statuses" WHERE "user_trip_statuses"."trip_id" = $1 AND "user_trip_statuses"."invitation_accepted" = $2 AND "user_trip_statuses"."form_filled" = $3  [["trip_id", 1], ["invitation_accepted", true], ["form_filled", false]]
---
          <%# TODO: REFACTO - Move this query to a model method: trip.pending_preferences_count %>
          Sharing preferences (<%= trip.user_trip_statuses.where(invitation_accepted: true, form_filled: false).count %>)

SELECT COUNT(*) FROM "user_trip_statuses" WHERE "user_trip_statuses"."trip_id" = $1 AND "user_trip_statuses"."recommendation_reviewed" = $2 AND "user_trip_statuses"."form_filled" = $3  [["trip_id", 1], ["recommendation_reviewed", false], ["form_filled", true]]
---
          <%# TODO: REFACTO - Move this query to a model method: trip.reviewing_suggestions_count %>
          Reviewing suggestions (<%= trip.user_trip_statuses.where(recommendation_reviewed: false, form_filled: true).count %>)

SELECT COUNT(*) FROM "users" INNER JOIN "user_trip_statuses" ON "users"."id" = "user_trip_statuses"."user_id" WHERE "user_trip_statuses"."trip_id" = $1  [["trip_id", 1]]
---
          <%# TODO: REFACTO - Clarify what "There yugo" means and adjust logic if needed %>
          There yugo (<%= trip.users.count %>)