app/controllers/itineraries_controller.rb

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."trip_id" = $1 AND "itineraries"."id" = $2 LIMIT $3  [["trip_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    @trip = Trip.find(params[:trip_id])
    @itinerary = @trip.itineraries.find(params[:id])