app/controllers/trips_controller.rb

SELECT "user_trip_statuses".* FROM "user_trip_statuses" WHERE "user_trip_statuses"."trip_id" = $1 AND "user_trip_statuses"."user_id" = $2 LIMIT $3  [["trip_id", 3], ["user_id", 9], ["LIMIT", 1]]
SELECT "user_trip_statuses".* FROM "user_trip_statuses" WHERE "user_trip_statuses"."user_id" = $1 AND "user_trip_statuses"."invitation_accepted" = $2  [["user_id", 9], ["invitation_accepted", false]]
---
  def index
    # Récupérer tous les user_trip_statuses de l'utilisateur avec leurs trips
    user_trip_statuses = current_user.user_trip_statuses.includes(:trip)

    # Séparer les invitations pending et les trips acceptés
    pending_invitations = user_trip_statuses.where(invitation_accepted: false)
    accepted_trips = user_trip_statuses.where(invitation_accepted: true)